In [3]:
# cell 1
# Importing all necessary packages from python
import pandas as pd
import matplotlib.pyplot as plt

In [4]:
# cell 2
# Loading dataset (this is a csv file)
data = pd.read_csv("churn.csv")

##### 1- Examining dataset structure:
Randomly choose 10 of them (total 10,000)

In [6]:
# cell 3
data.sample(10)

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
6001,6002,15606887,Singh,775,France,Female,30,5,0.00,1,1,0,193880.60,1
3853,3854,15631392,Douglas,654,Germany,Male,43,9,84673.17,2,0,1,82081.35,0
4478,4479,15622443,Marshall,549,France,Male,31,4,0.00,2,0,1,25684.85,0
8084,8085,15736146,Afamefula,608,Germany,Male,28,4,96679.71,1,1,1,49133.45,0
4183,4184,15625592,Sal,486,France,Male,26,2,0.00,2,1,1,31399.40,0
2542,2543,15791102,Mai,549,Germany,Male,41,9,95020.80,3,1,1,131710.59,1
6450,6451,15781409,Lazarev,834,France,Female,28,6,0.00,1,1,0,74287.53,0
6767,6768,15654964,Piccio,608,Spain,Male,48,7,75801.74,1,1,0,125762.95,0
9143,9144,15793197,Bailey,676,France,Female,34,8,100359.54,1,0,0,46038.28,0
3834,3835,15704819,Ositadimma,734,Spain,Female,39,6,92126.26,2,0,0,112973.34,0

##### I- Interpretation on data:
As we know, "RowNumber", "CustomerId" and "Surname" of each person do not affect the desire to stay or leave the bank.

In [7]:
# cell 4
# In this case, we can remove those three features from the dataset.
data.drop(['RowNumber', 'CustomerId', 'Surname'], axis=1, inplace=True)

##### Check if it was deleted correctly?

In [8]:
# cell 5
data.sample(10)

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
5161,842,Spain,Male,46,9,0.00,1,0,0,17268.02,0
7721,757,Germany,Male,33,1,122088.67,1,1,0,42581.09,0
1784,658,France,Male,36,8,174060.46,1,1,1,94925.62,0
6009,525,Spain,Male,33,5,0.00,2,1,0,161002.29,0
5283,656,Germany,Female,23,4,163549.63,1,0,1,21085.12,0
8706,850,Spain,Female,55,7,0.00,1,0,0,171762.87,1
8712,469,Spain,Male,35,5,0.00,2,1,0,186490.37,0
8834,657,France,Male,34,3,107136.60,1,1,0,153895.46,0
1078,677,Germany,Female,41,8,146720.98,2,1,1,4195.84,0
8122,564,France,Female,53,2,45472.28,1,1,1,41055.71,1

In [11]:
# cell 6
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   CreditScore      10000 non-null  int64
 1   Geography        10000 non-null  object
 2   Gender           10000 non-null  object
 3   Age              10000 non-null  int64
 4   Tenure           10000 non-null  int64
 5   Balance          10000 non-null  float64
 6   NumOfProducts    10000 non-null  int64
 7   HasCrCard        10000 non-null  int64
 8   IsActiveMember   10000 non-null  int64
 9   EstimatedSalary  10000 non-null  float64
 10  Exited           10000 non-null  int64
dtypes: float64(2), int64(7), object(2)
memory usage: 859.5+ KB

##### We don't have any Not-A-Number(NaN) or missing values.

##### In order to be able to give the dataset to the model (although we haven't specified it yet), the values ​​of all the features must be numerical.
As you saw result of the cell 6, "Geography" and "Gender" are nominal (name and without order) features. we have two way change categorical features (they aren't numbers) into numerical features.
##### We have two main way: 1- OneHot Encoding 2- Labeling Encoding
##### Both of them are useful but when we face with nominal features (categorical without order) it's necessary to use OneHot Encoding. Because if we use Label Encoding, the order that occurs between the numbers will affect the training of the model and its subsequent predictions.

In [14]:
# Using OneHot Encoding:
data = pd.get_dummies(data)

In [15]:
data.sample(10)

,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Geography_France,Geography_Germany,Geography_Spain,Gender_Female,Gender_Male
3212,611,35,10,0.00,1,1,1,23598.23,1,True,False,False,False,True
5487,763,35,9,0.00,1,1,1,31372.91,0,True,False,False,False,True
5620,553,31,6,0.00,2,0,0,124596.63,0,True,False,False,False,True
5442,613,43,10,120481.69,1,0,0,94875.03,1,False,True,False,True,False
8846,571,53,2,0.00,2,1,0,28045.77,0,True,False,False,True,False
6440,790,47,10,148636.21,1,0,1,16119.96,1,True,False,False,True,False
1379,668,32,10,92041.87,1,1,1,43595.90,0,False,True,False,True,False
6938,725,33,4,0.00,1,1,1,67879.80,0,True,False,False,True,False
8284,711,39,3,152462.79,1,1,0,90305.97,0,True,False,False,True,False
8710,678,37,2,113383.07,1,1,1,135123.96,0,False,True,False,True,False

##### As you see, now we have only 14 features for each person.
Notice that we customers only from Germany, French and Spain.